
$(document).ready(function() {
        
        //for pagepiling
        var nav = ['首页', '前端是什么', '一些观察', '我爱互联网', '一个奇怪的想法', '淘宝教育', '一张思维草图','一张UI','我身边的物流','我看菜鸟','求通过'];
        $('.section').addClass('initing');
        $('#pagepiling').pagepiling({
            loopBottom: true,
            navigation: {
                'position': 'left',
                'tooltips': nav
            },
            onLeave: function(index, nextIndex, direction) {
                var $pages = $('.section');
                for (var i = 0; i < $pages.length; ++i) {
                    if (i + 1 !== nextIndex) {
                        $($pages[i]).addClass('leaving');
                    } else {
                        $($pages[i]).removeClass('leaving');
                    }
                }
            }
        });
        $('.initing').removeClass('initing');
    
    
    
    
    

        //一些观察
    var eyes = [
       ["网易云音乐的iPhone菜单控件","用户想要播放上一首时必须经过两次点击，而多余的“喜欢”功能：用户被音乐打动时往往会打开App看评论或收听更多相似歌曲，而不是繁琐地戳下菜单上的“喜欢”。且菜单控件里“喜欢”功能对应的是星星图标，反馈效果远远不如App界面里动态、有积极反馈的红心❤️收藏图标。"],
       ["淘宝iOS端","初次打开淘宝App时会连续跳出三个权限请求弹窗，非常容易引起用户疑虑（尤其是中老年人用户）；且若用户选择不开放权限，后期需要用到时还要重新到系统配置里设置，非常麻烦，而faceu的权限体验则好得多。"],
       ["飞猪旅行","飞猪旅行高铁票订票入口不再提供“热门站点”快速选项（如“广州”“深圳”），订票流程浪费了用户时间。"],
       ["飞猪旅行","还是高铁票……抢票功能里：筛选班次时没有限制高铁站点功能，如“广州-广州南站”。假如用户心急如焚地想要抢【深圳去往广州】的票，这两个地点都有多个高铁站多班车，用户就必须从数百班次里慢慢挑选适合自己的车站。用户流失成功。"],
       ["微信公众号","微信订阅号的入口上方的搜索框只能搜索公众号文章，却不能搜索公众号。每次想从上百个号里找到想看的那个时，必须返回上一层使用首页顶部的搜索框。"],
      ["微信","虽然微信因语音聊天而收获很多用户，但现实生活中语音聊天的效率远远低于文字聊天：点开语音->耳朵靠近听筒->还得小心在公众场合发出声音->再回复，如果是不方便收听的场合，可能还会忘记回复；而文字则方便得多：第一眼就能获取信息并回复；如果能推出【语音自动转文字】的功能，能方便很多用户。"],
      ["阿里云","阿里云的网站酷炫、产品、技术也非常棒。<br>但上次注册新账号时，网页右上角的头像默认显示为“男程序员”的形象。阿里云的用户应该不仅仅只有男性吧……小伤心。"],
       ["支付宝","首页底部footer的那句“我是有底线的”好可爱(*≧▽≦*)"],
    ["百度","搜索框输入“自杀”会跳出心理求助热线，也许能拯救不少想要放弃生命的人……"],
       ["微信","用户A用手机注册了微信号并设置了“无法通过手机号被搜索到”。<br>但其实只要恶意用户B将用户A的手机号添加到手机通讯录，微信便会自动推荐A的微信给B。"],
       ["支付宝","支付宝完成支付后显示的动画，看着特别舒服而且转移了用户焦虑等待时的注意力。微信支付“完成支付”的体验则一般，完成后还会跳出消息提醒，以为自己收到了一条新信息结果是微信官方发的……形成了一定心理落差。"],
       ["ofo共享单车","每次使用后总是忘记支付，第二次想要用车时：“你还没有支付”->确认支付->又跳出了分享红包的页面->返回->广告->再返回->再输入车牌号……在急着赶去某地的时候遇到这些情况内心会非常不愉快……询问过周围的人，表示同感。"],
       ["笔记本电脑","大多数电脑的触控板响应迟钝、几乎没有用处，每次带出门时都必须惦记带一个鼠标，否则工作效率大大降低。既然触控板占据了产品的大面积，又无法发挥作用，为什么不去掉呢？接触到MacBook后才第一次因为顺滑的触控板体验全身心地感到舒畅……"],
       ["水龙头","有一些水龙头的出水口非常靠近池壁，刚洗完手，碰到池壁，又得重新洗一遍……<br>按压式水龙头，按一下，出水一秒，完全洗不干净……"],
       ["记事本","遇到平铺写作时不会碍手的笔记本就嫁了吧OTL。"],
       ["医院输液","为什么朋友圈经常会有人放输液、打吊瓶时的照片？病人在输液时，孤独、难过的情绪会被放大无数倍。如果医院可以在输液瓶的标签或者其他小细节给病人一点暖心的感觉，世界会不会稍微变好一点……"],
       ["医院住院","医院里长时间居住的病人太多了，白色病房带来的压抑感、孤独感，再乐观的人都可能承受不住。如果医院有条件可以提供一些有积极意义的书/音乐/电视剧/电影等，让病人减少一些绝望和阴暗，精神变阳光了，对身体的痊愈也是有帮助的。当然，卫生和经济都是必须考虑的因素。"],
       ["高校宿舍楼","“宿管阿姨我放个东西在这里可以吗”“尽快拿走！”<br>这是每栋宿舍楼每天都在发生的对话。校园内经常有需要交换物品的场景（带饭、代领快递、送课本给师妹等），而宿舍一楼通常都会有一面占据了大空间却没什么关注量的荣誉墙，如果可以利用这个空间放置一个密码储物柜(类似快递蜜蜂箱)，不仅可以解决快递公司“最后一公里”的问题，还能提高同学的生活质量。"],
       ["搜索引擎","微信搜索+知乎搜索+微博搜索经常能搜到常规搜索引擎搜不到的好内容，比如旅行攻略、电影网盘下载、社会新事件等。"],
       ["淘宝App","旺旺消息不能“一键已读”，又不想一个一个把红点消掉，非常难受···"],
       ["淘宝App","“收藏夹”纯文字、没有icon，不容易被视线捕捉到，且离右手拇指较远，损失了很多让用户“浏览自己的收藏夹后冲动下单”的机会"],
       ["恐怖片海报","真正好的恐怖片不应该通过血腥的海报来吸引观众，还会引起不喜欢恐怖片的人群的不适。一些影院有在洗手间设置电影海报的规定：有一天晚上看完电影洗手后转身发现一张恐怖片海报上的脸正虎视眈眈地看着自己，吓得魂都没有了:)"],
       ["豆瓣App","豆瓣官方的“书影音”资源和个人记录的“书影音”必须从两个不同的菜单入口进入，容易降低用户黏度"],
       ["支付宝高铁飞机票入口","业务逐渐转移到“飞猪旅行”App上，但在支付宝上提示“请下载飞猪App”的时候并没有提供跳转下载App的链接，用户损失转向隔壁“高铁管家”。"],
       ["花生地铁Wifi","覆盖广州地铁线路的Wifi。但用户第一次使用时必须下载官方App，如果用户有足够的流量去下载一个App，为什么还要连Wifi呢……"]
    ]
        
    var apps_name= [
      ["网易云音乐","虾米音乐","豆瓣FM"],
      ["Keep","Nike+Running","咕咚运动"],  
      ["SleepCycle","蜗牛睡眠","Sleep Better"],  
      ["拓词背单词","扇贝单词","百词斩","不背单词"],  
      ["Kindle App","微信读书","网易蜗牛读书"],  
      ["涂书笔记","萝卜书摘"],  
      ["淘宝","亚马逊","京东"]
    ];
    var apps_good=[
      ["丰富的歌单<br>音乐社交","曲库全<br>音乐氛围","不可回播<br>算法精准"],  
      ["丰富的运动课程<br>明星入驻效应<br>用户积极晒肌肉","Nike自家App<br>计数一米不差<br>排行榜+组队模式<br>运动轨迹美观","社交效应好<br>多地组织跑团"],  
      ["小而美<br>用了四年从未卸载<br>曲线趋势简洁明了<br>世界睡眠数据分析<br>唤醒时间精确","国产睡眠软件<br>记录梦话<br>图表简洁配色清新<br>用户梦话分享","和前者一样好用<br>没有梦话记录"],  
      ["最早的单词软件<br>快速记单词<br>感谢高中的陪伴","系列产品非常优秀<br>扇贝听力扇贝阅读<br>用户黏度高<br>例句、笔记丰富<br>艾宾浩斯记忆曲线","图片联想记忆<br>组队模式很棒<br>文案用心<br>周边产品用心","原滋原味地道例句<br>用完即走<br>界面好看<br>名字新颖<br>签到可背更多单词"],  
      ["Kindle自家App<br>图书丰富<br>正版<br>包月会员低价","微信社交群连接<br>读书界面非常精美<br>书籍逐渐丰富<br>可以看好友的书架<br>“时长换书币”","四月新品<br>“每日免费一小时”<br>击中用户痛点"],  
      ["百度出品<br>照片文字识别<br>线上读书笔记","操作简洁<br>细节用心<br>社群分享好书好句<br>界面美观<br>笔记背景丰富<br>自动联想同类笔记"],  
      ["什么都能买到<br>真的什么都能买到<br>改变中国<br>改变世界<br>宇宙无敌","快递单最好撕<br>快递箱美观<br>永远在心理预期前<br>准时到达<br>十八线城市送货快<br>快递员态度好","价格低<br>优惠活动多<br>速度快<br>数码家电强"] 
    ];
    var apps_bad=[
      ["专辑歌单混淆<br>无营养评论多<br>算法一般","操作不够简便<br>缓存限制提示","较为小众"],  
      ["跑步计数不准确<br>社交功能一般<br>容易视觉疲劳","注册等待时间长<br>好友添加功能一般","配色不是很好看···"],  
      ["记录不及后者清晰","害怕听梦话···<br>不适合<br>私人记录爱好者","缺点想不出来"],
      ["后劲不足<br>16年倒闭现重建中<br>不适合长期记忆","缺点想不出来<br>用过都说好","容易只记得图片<br>不记得单词<br>部分联想不合理","收费<br>易损失<br>高强度学习用户"],  
      ["App不用心<br>几乎没有改进<br>读书界面不好看<br>字体选择少<br>书页背景选择少","书籍资源少<br>不适合版本挑剔者","还在观望中",""],  
      ["识别经常出错<br>社交一般","有文艺化的趋势<br>小学生越来越多<br>社群书摘质量下降"],  
      ["快递质量参差不齐","网站长得丑<br>移动端体验一般","书籍常带灰或破损<br>不能忍<br>界面容易引起用户<br>冲动消费"]
    ];
    
    
    var length1 = 25;
    var length2 = 7;
    var index1 = 0;
    var index2 = 0;
    
        $('#left1').click(function(){
                index1--;
                if(index1==-1) {
                    index1 = length1-1;
                }
                changeEyes();
        });
        $('#right1').click(function(){
                index1++;
                if(index1==length1) {
                    index1 = 0;
                }
                changeEyes();
        });
    
   
        $('#left2').click(function(){
                index2--;
                if(index2==-1) {
                    index2 = length2-1;
                }
                changeApps();
         });         
        $('#right2').click(function(){
                index2++;
                if(index2==7) {
                    index2 = 0;
                }
                changeApps();
        });
    
    
     function changeEyes(){
        var text = "<a class='name'>"+eyes[index1][0]+"</a><p class='content'>"+eyes[index1][1]+"<img src='img/eyes/"+index1+".jpg'></p>";
        $("#eyes").html(text);
     };
    function changeApps(){
                var text1 = "<div class='product-name'>";
                var text2 = "<div class='product-good'><img src='img/Smile.svg'>";
                var text3 = "<div class='product-sad'><img src='img/cry.svg'>";
                var content1 = apps_name[index2];
                var content2 = apps_good[index2];
                var content3 = apps_bad[index2];
                for(var i=0;i<content1.length;i++) {
                    text1 += "<h3>"+content1[i]+"</h3>";
                    text2 += "<p>"+content2[i]+"</p>";
                    text3 += "<p>"+content3[i]+"</p>";
                    
                }
                text1+="</div>";
                text2+="</div>";
                text3+="</div>";
                $("#app").html(text1+text2+"<div class='blank'></div>"+text3);
      
    }

});
